module.exports = {
  trailingComma: "none", // Отсутствие запятых после последнего элемента объекта или массива
  tabWidth: 2, // Ширина отступа в два пробела
  printWidth: 80,
  semi: true, // Автоматическая вставка точек с запятой
  singleQuote: false, // Использование одинарных кавычек для строк
  quoteProps: "preserve", // Сохранение кавычек только для нестандартных свойств объекта
  arrowParens: "always", // Всегда оборачивать аргументы стрелочных функций в скобки
  bracketSpacing: true, // Добавлять пробелы вокруг скобок в объектах
  jsxBracketSameLine: false, // Не размещать закрывающие скобки JSX на той же строке, что и открывающие
  proseWrap: "never", // Отключение автоматической переноса строк в тексте
  htmlWhitespaceSensitivity: "strict", // Строгая чувствительность к пробелам в HTML
  endOfLine: "lf" // Формат окончания строки (перевод строки LF)
};
